HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_6_OFF (22u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_6_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_6_7_OFF (23u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_0 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_0_OFF (24u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_1 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_1_OFF (25u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_2 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_2_OFF (26u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_3 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_3_OFF (27u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_4 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_4_OFF (28u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_5 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_5_OFF (29u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_6 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_6_OFF (30u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R1_Bits.MCA_7_7 */
#define IFX_GTM_MON_ACTIVITY_R1_MCA_7_7_OFF (31u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_0_OFF (0u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_1_OFF (1u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_2_OFF (2u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_3_OFF (3u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_4_OFF (4u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_5_OFF (5u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_6_OFF (6u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_7_OFF (7u)

/** \brief Length for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_OFF (0u)

