HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM1_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM1_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.PSM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM1_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_DCGI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_DCGI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_DCGI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_DCGI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_DCGI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_DCGI_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EDI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EDI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EDI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EDI_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TINI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TINI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TINI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TINI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TINI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TINI_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TAXI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TAXI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TAXI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TAXI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TAXI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TAXI_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SISI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SISI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SISI_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TISI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TISI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TISI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TISI_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MSI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MSI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MSI_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MTI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MTI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_MTI_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SASI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SASI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_SASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_SASI_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TASI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TASI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_TASI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_TASI_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_PWI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_PWI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_PWI_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W2I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W2I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W2I_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W1I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W1I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_W1I_IRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL1I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL1I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL1I_IRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL1I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL1I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_LL1I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_LL1I_IRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_EI_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_EI_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL2I_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL2I_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_R1_DPLL_GL2I_IRQ_OFF (16u)

