HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM4_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM4_CH15_IRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH8_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH8_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH8_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH8_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH9_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH9_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH9_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH9_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH10_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH10_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH10_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH11_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH11_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH11_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH12_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH12_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH12_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH13_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH13_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH13_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH14_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH14_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH14_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH15_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH15_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R8_Bits.TOM5_CH15_IRQ */
#define IFX_GTM_ICM_IRQG_R8_TOM5_CH15_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM0_CH1_IRQ_LEN (1u)

