HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH3_IRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH4_IRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH5_IRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH6_IRQ_OFF (22u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM2_CH7_IRQ_OFF (23u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH0_IRQ_OFF (24u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH1_IRQ_OFF (25u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH2_IRQ_OFF (26u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH3_IRQ_OFF (27u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH4_IRQ_OFF (28u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH5_IRQ_OFF (29u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH6_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH6_IRQ_OFF (30u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH7_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH7_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R9_Bits.ATOM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_R9_ATOM3_CH7_IRQ_OFF (31u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH2_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH3_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH4_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH5_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH6_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R10_Bits.ATOM4_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_R10_ATOM4_CH6_IRQ_MSK (0x1u)

