HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH6_EIRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM4_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM4_CH7_EIRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH0_EIRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH1_EIRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH2_EIRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH3_EIRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH4_EIRQ_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH5_EIRQ_OFF (13u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH6_EIRQ_OFF (14u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH7_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH7_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM5_CH7_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM5_CH7_EIRQ_OFF (15u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH0_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH0_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH0_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH0_EIRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH1_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH1_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH1_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH1_EIRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH2_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH2_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH2_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH2_EIRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH3_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH3_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH3_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH3_EIRQ_OFF (19u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH4_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH4_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH4_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH4_EIRQ_OFF (20u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH5_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH5_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH5_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH5_EIRQ_OFF (21u)

/** \brief Length for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH6_EIRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH6_EIRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_CEI2_Bits.TIM6_CH6_EIRQ */
#define IFX_GTM_ICM_IRQG_CEI2_TIM6_CH6_EIRQ_OFF (22u)

