HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT0_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT0 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT1_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT1 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT1_OFF (2u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT2_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT2 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT2_OFF (4u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT3_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT3 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT3_OFF (6u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT4_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT4 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT4_OFF (8u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT5_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT5 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT5_OFF (10u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT6_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT6 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT6_OFF (12u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT7_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_STAT_Bits.OUTEN_STAT7 */
#define IFX_GTM_TOM_TGC_OUTEN_STAT_OUTEN_STAT7_OFF (14u)

/** \brief Length for Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO_ADDR_LEN (9u)

/** \brief Mask for Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO_ADDR_MSK (0x1ffu)

/** \brief Offset for Ifx_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO_Bits.ADDR */
#define IFX_GTM_PSM_F2A_RD_CH_ARU_RD_FIFO_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_PSM_F2A_STR_CH_STR_CFG_TMODE_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_PSM_F2A_STR_CH_STR_CFG_TMODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_STR_CH_STR_CFG_Bits.TMODE */
#define IFX_GTM_PSM_F2A_STR_CH_STR_CFG_TMODE_OFF (16u)

/** \brief Length for Ifx_GTM_PSM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_PSM_F2A_STR_CH_STR_CFG_DIR_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_PSM_F2A_STR_CH_STR_CFG_DIR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_F2A_STR_CH_STR_CFG_Bits.DIR */
#define IFX_GTM_PSM_F2A_STR_CH_STR_CFG_DIR_OFF (18u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR0_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR0_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR0_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR0_EN_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR1_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR1_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR1_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR1_EN_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR2_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR2_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR2_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR2_EN_OFF (4u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR3_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR3_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR3_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR3_EN_OFF (6u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR4_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR4_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR4_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR4_EN_OFF (8u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR5_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR5_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR5_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR5_EN_OFF (10u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR6_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR6_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR6_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR6_EN_OFF (12u)

/** \brief Length for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR7_EN_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR7_EN_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_ENABLE_Bits.STR7_EN */
#define IFX_GTM_PSM_F2A_ENABLE_STR7_EN_OFF (14u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR4_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR4_CONF_MSK (0x3u)

