HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_T */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_T_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_T */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_T_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_S */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_S_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_S */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_S_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.STA_FLAG_S */
#define IFX_GTM_DPLL_STA_FLAG_STA_FLAG_S_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT1_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT1_FLAG_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT1_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT1_FLAG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT1_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT1_FLAG_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT2_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT2_FLAG_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT2_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT2_FLAG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STA_FLAG_Bits.INC_CNT2_FLAG */
#define IFX_GTM_DPLL_STA_FLAG_INC_CNT2_FLAG_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_INC_CNT1_MASK_Bits.INC_CNT1_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT1_MASK_INC_CNT1_NOTIFY_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_INC_CNT1_MASK_Bits.INC_CNT1_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT1_MASK_INC_CNT1_NOTIFY_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_INC_CNT1_MASK_Bits.INC_CNT1_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT1_MASK_INC_CNT1_NOTIFY_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_INC_CNT2_MASK_Bits.INC_CNT2_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT2_MASK_INC_CNT2_NOTIFY_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_INC_CNT2_MASK_Bits.INC_CNT2_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT2_MASK_INC_CNT2_NOTIFY_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_INC_CNT2_MASK_Bits.INC_CNT2_NOTIFY */
#define IFX_GTM_DPLL_INC_CNT2_MASK_INC_CNT2_NOTIFY_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OLD_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OLD_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT1_Bits.SYN_S_OLD */
#define IFX_GTM_DPLL_NUSC_EXT1_SYN_S_OLD_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT1_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_EXT1_WSYN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT1_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_EXT1_WSYN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT1_Bits.WSYN */
#define IFX_GTM_DPLL_NUSC_EXT1_WSYN_OFF (30u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_EXT2_NUSE_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_EXT2_NUSE_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.NUSE */
#define IFX_GTM_DPLL_NUSC_EXT2_NUSE_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_EXT2_FSS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_EXT2_FSS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.FSS */
#define IFX_GTM_DPLL_NUSC_EXT2_FSS_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_EXT2_VSN_LEN (7u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_EXT2_VSN_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.VSN */
#define IFX_GTM_DPLL_NUSC_EXT2_VSN_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_EXT2_WNUS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_EXT2_WNUS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WNUS */
#define IFX_GTM_DPLL_NUSC_EXT2_WNUS_OFF (29u)

/** \brief Length for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_EXT2_WVSN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_EXT2_WVSN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_NUSC_EXT2_Bits.WVSN */
#define IFX_GTM_DPLL_NUSC_EXT2_WVSN_OFF (31u)

/** \brief Length for Ifx_GTM_DPLL_CTN_MIN_Bits.CTN_MIN */
#define IFX_GTM_DPLL_CTN_MIN_CTN_MIN_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_CTN_MIN_Bits.CTN_MIN */
#define IFX_GTM_DPLL_CTN_MIN_CTN_MIN_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_CTN_MIN_Bits.CTN_MIN */
#define IFX_GTM_DPLL_CTN_MIN_CTN_MIN_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CTN_MAX_Bits.CTN_MAX */
#define IFX_GTM_DPLL_CTN_MAX_CTN_MAX_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_CTN_MAX_Bits.CTN_MAX */
#define IFX_GTM_DPLL_CTN_MAX_CTN_MAX_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_CTN_MAX_Bits.CTN_MAX */
#define IFX_GTM_DPLL_CTN_MAX_CTN_MAX_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CSN_MIN_Bits.CSN_MIN */
#define IFX_GTM_DPLL_CSN_MIN_CSN_MIN_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_CSN_MIN_Bits.CSN_MIN */
#define IFX_GTM_DPLL_CSN_MIN_CSN_MIN_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_CSN_MIN_Bits.CSN_MIN */
#define IFX_GTM_DPLL_CSN_MIN_CSN_MIN_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_CSN_MAX_Bits.CSN_MAX */
#define IFX_GTM_DPLL_CSN_MAX_CSN_MAX_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_CSN_MAX_Bits.CSN_MAX */
#define IFX_GTM_DPLL_CSN_MAX_CSN_MAX_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_CSN_MAX_Bits.CSN_MAX */
#define IFX_GTM_DPLL_CSN_MAX_CSN_MAX_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_RDT_TI_Bits.RDT_T */
#define IFX_GTM_DPLL_RDT_TI_RDT_T_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_RDT_TI_Bits.RDT_T */
#define IFX_GTM_DPLL_RDT_TI_RDT_T_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_RDT_TI_Bits.RDT_T */
#define IFX_GTM_DPLL_RDT_TI_RDT_T_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TSF_TI_Bits.TSF_T */
#define IFX_GTM_DPLL_TSF_TI_TSF_T_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TSF_TI_Bits.TSF_T */
#define IFX_GTM_DPLL_TSF_TI_TSF_T_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TSF_TI_Bits.TSF_T */
#define IFX_GTM_DPLL_TSF_TI_TSF_T_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ADT_TI_Bits.PD */
#define IFX_GTM_DPLL_ADT_TI_PD_LEN (13u)

