HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH_STRG_TRG6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH_STRG_TRG6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG6 */
#define IFX_GTM_MCS_CH_STRG_TRG6_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH_STRG_TRG7_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH_STRG_TRG7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG7 */
#define IFX_GTM_MCS_CH_STRG_TRG7_OFF (7u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH_STRG_TRG8_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH_STRG_TRG8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG8 */
#define IFX_GTM_MCS_CH_STRG_TRG8_OFF (8u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH_STRG_TRG9_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH_STRG_TRG9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG9 */
#define IFX_GTM_MCS_CH_STRG_TRG9_OFF (9u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH_STRG_TRG10_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH_STRG_TRG10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG10 */
#define IFX_GTM_MCS_CH_STRG_TRG10_OFF (10u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH_STRG_TRG11_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH_STRG_TRG11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG11 */
#define IFX_GTM_MCS_CH_STRG_TRG11_OFF (11u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH_STRG_TRG12_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH_STRG_TRG12_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG12 */
#define IFX_GTM_MCS_CH_STRG_TRG12_OFF (12u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH_STRG_TRG13_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH_STRG_TRG13_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG13 */
#define IFX_GTM_MCS_CH_STRG_TRG13_OFF (13u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH_STRG_TRG14_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH_STRG_TRG14_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG14 */
#define IFX_GTM_MCS_CH_STRG_TRG14_OFF (14u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH_STRG_TRG15_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH_STRG_TRG15_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG15 */
#define IFX_GTM_MCS_CH_STRG_TRG15_OFF (15u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH_STRG_TRG16_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH_STRG_TRG16_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG16 */
#define IFX_GTM_MCS_CH_STRG_TRG16_OFF (16u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH_STRG_TRG17_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH_STRG_TRG17_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG17 */
#define IFX_GTM_MCS_CH_STRG_TRG17_OFF (17u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH_STRG_TRG18_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH_STRG_TRG18_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG18 */
#define IFX_GTM_MCS_CH_STRG_TRG18_OFF (18u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH_STRG_TRG19_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH_STRG_TRG19_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG19 */
#define IFX_GTM_MCS_CH_STRG_TRG19_OFF (19u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH_STRG_TRG20_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH_STRG_TRG20_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG20 */
#define IFX_GTM_MCS_CH_STRG_TRG20_OFF (20u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH_STRG_TRG21_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH_STRG_TRG21_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG21 */
#define IFX_GTM_MCS_CH_STRG_TRG21_OFF (21u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH_STRG_TRG22_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH_STRG_TRG22_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG22 */
#define IFX_GTM_MCS_CH_STRG_TRG22_OFF (22u)

/** \brief Length for Ifx_GTM_MCS_CH_STRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH_STRG_TRG23_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_STRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH_STRG_TRG23_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_STRG_Bits.TRG23 */
#define IFX_GTM_MCS_CH_STRG_TRG23_OFF (23u)

/** \brief Length for Ifx_GTM_MCS_CH_MHB_Bits.DATA */
#define IFX_GTM_MCS_CH_MHB_DATA_LEN (8u)

/** \brief Mask for Ifx_GTM_MCS_CH_MHB_Bits.DATA */
#define IFX_GTM_MCS_CH_MHB_DATA_MSK (0xffu)

/** \brief Offset for Ifx_GTM_MCS_CH_MHB_Bits.DATA */
#define IFX_GTM_MCS_CH_MHB_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_LEN (16u)

/** \brief Mask for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_MCS_CH_PC_Bits.PC */
#define IFX_GTM_MCS_CH_PC_PC_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.MCS_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_MCS_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.STK_ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_STK_ERR_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_ERR_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_ERR_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits.ERR_IRQ */
#define IFX_GTM_MCS_CH_IRQ_NOTIFY_ERR_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MCS_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MCS_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MCS_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MCS_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_EN_Bits.MCS_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_MCS_IRQ_EN_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_CH_IRQ_EN_Bits.STK_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_STK_ERR_IRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CH_IRQ_EN_Bits.STK_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_STK_ERR_IRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CH_IRQ_EN_Bits.STK_ERR_IRQ_EN */
#define IFX_GTM_MCS_CH_IRQ_EN_STK_ERR_IRQ_EN_OFF (1u)

