HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT3 */
#define IFX_GTM_MCS_CWT_CWT3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT3 */
#define IFX_GTM_MCS_CWT_CWT3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT3 */
#define IFX_GTM_MCS_CWT_CWT3_OFF (3u)

/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT4 */
#define IFX_GTM_MCS_CWT_CWT4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT4 */
#define IFX_GTM_MCS_CWT_CWT4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT4 */
#define IFX_GTM_MCS_CWT_CWT4_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT5 */
#define IFX_GTM_MCS_CWT_CWT5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT5 */
#define IFX_GTM_MCS_CWT_CWT5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT5 */
#define IFX_GTM_MCS_CWT_CWT5_OFF (5u)

/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT6 */
#define IFX_GTM_MCS_CWT_CWT6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT6 */
#define IFX_GTM_MCS_CWT_CWT6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT6 */
#define IFX_GTM_MCS_CWT_CWT6_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_CWT_Bits.CWT7 */
#define IFX_GTM_MCS_CWT_CWT7_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_CWT_Bits.CWT7 */
#define IFX_GTM_MCS_CWT_CWT7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_CWT_Bits.CWT7 */
#define IFX_GTM_MCS_CWT_CWT7_OFF (7u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR0 */
#define IFX_GTM_MCS_ERR_ERR0_OFF (0u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR1 */
#define IFX_GTM_MCS_ERR_ERR1_OFF (1u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR2 */
#define IFX_GTM_MCS_ERR_ERR2_OFF (2u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR3 */
#define IFX_GTM_MCS_ERR_ERR3_OFF (3u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR4 */
#define IFX_GTM_MCS_ERR_ERR4_OFF (4u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR5 */
#define IFX_GTM_MCS_ERR_ERR5_OFF (5u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR6 */
#define IFX_GTM_MCS_ERR_ERR6_OFF (6u)

/** \brief Length for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_LEN (1u)

/** \brief Mask for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MCS_ERR_Bits.ERR7 */
#define IFX_GTM_MCS_ERR_ERR7_OFF (7u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXGTM_BF_H */
